Revit 2026 API

# STEPApplicationProtocol Enumeration

---

An enumeration for STEP Application Protocols.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum STEPApplicationProtocol
```
```vb
Public Enumeration STEPApplicationProtocol
```
```cpp
public enum class STEPApplicationProtocol
```
```fsharp
type STEPApplicationProtocol
```

| Member name | Value | Description |
| --- | --- | --- |
| ApplicationProtocol203 | 0 | Configuration Controlled Design Protocol 203. |
| ApplicationProtocol214 | 1 | Automotive Design Protocol 214. |
| ApplicationProtocol242 | 2 | Managed Model Based 3D Engineering, Includes Product Manufacturing Information Protocol 242. |

#### Reference

Autodesk.Revit.DB Namespace